**Predicting Survival in the Titanic Data Set** 
 
We will be using a decision tree to make predictions about the Titanic data set from Kaggle. This data set provides information on the Titanic passengers and can be used to predict whether a passenger survived or not.

# Loading Data and modules

In [2]:
import sklearn 
import numpy as np 
import pandas as pd 
import seaborn as sb 
from sklearn import tree
from pylab import rcParams 
from sklearn import metrics
import matplotlib.pyplot as plt
from sklearn import preprocessing 
from pandas import Series, DataFrame
# from sklearn.preprocessing import Imputer
from sklearn.metrics import classification_report 
from sklearn.linear_model import LogisticRegression 
from sklearn.model_selection import train_test_split

Use only Pclass, Sex, Age, SibSp (Siblings aboard), Parch (Parents/children aboard), and Fare to predict whether a passenger survived.

In [29]:
# url='https://raw.githubusercontent.com/BigDataGal/Python-for-DataScience/master/titanic-train.csv'
 
titanic = pd.read_csv('titanic_train.csv') 
 
titanic.columns = ['PassengerId','Survived','Pclass','Name','Sex','Age','SibSp','Parch','Ti cket','Fare','Cabin','E mbarked']

In [30]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ti cket,Fare,Cabin,E mbarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [31]:
titanic.drop(['PassengerId','Name','Ti cket','Cabin','E mbarked'],axis = 1, inplace = True)

In [32]:
titanic.columns

Index(['Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare'], dtype='object')

In [33]:
titanic.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
dtype: int64

In [34]:
titanic.Age.mean()

29.69911764705882

In [35]:
titanic.fillna(titanic.Age.mean(),inplace = True)

In [36]:
titanic.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
dtype: int64

In [37]:
titanic.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  891.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   13.002015    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   22.000000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   29.699118    0.000000    0.000000   14.454200
75%      1.000000    3.000000   35.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [38]:
titanic1 = pd.get_dummies(titanic.Sex)

In [39]:
titanic = pd.concat([titanic,titanic1],axis = 1)

In [40]:
titanic.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare  female  male
0         0       3    male  22.0      1      0   7.2500       0     1
1         1       1  female  38.0      1      0  71.2833       1     0
2         1       3  female  26.0      0      0   7.9250       1     0
3         1       1  female  35.0      1      0  53.1000       1     0
4         0       3    male  35.0      0      0   8.0500       0     1

In [41]:
titanic.drop('Sex',axis = 1)

     Survived  Pclass        Age  SibSp  Parch     Fare  female  male
0           0       3  22.000000      1      0   7.2500       0     1
1           1       1  38.000000      1      0  71.2833       1     0
2           1       3  26.000000      0      0   7.9250       1     0
3           1       1  35.000000      1      0  53.1000       1     0
4           0       3  35.000000      0      0   8.0500       0     1
..        ...     ...        ...    ...    ...      ...     ...   ...
886         0       2  27.000000      0      0  13.0000       0     1
887         1       1  19.000000      0      0  30.0000       1     0
888         0       3  29.699118      1      2  23.4500       1     0
889         1       1  26.000000      0      0  30.0000       0     1
890         0       3  32.000000      0      0   7.7500       0     1

[891 rows x 8 columns]

In [42]:
y = targets = labels = titanic["Survived"]
inputs=titanic.drop(['Survived'],axis=1)

In [43]:
inputs.head()

   Pclass     Sex   Age  SibSp  Parch     Fare  female  male
0       3    male  22.0      1      0   7.2500       0     1
1       1  female  38.0      1      0  71.2833       1     0
2       3  female  26.0      0      0   7.9250       1     0
3       1  female  35.0      1      0  53.1000       1     0
4       3    male  35.0      0      0   8.0500       0     1

In [44]:
inputs.drop(['Sex'],axis=1,inplace=True)

In [45]:
inputs.head()

   Pclass   Age  SibSp  Parch     Fare  female  male
0       3  22.0      1      0   7.2500       0     1
1       1  38.0      1      0  71.2833       1     0
2       3  26.0      0      0   7.9250       1     0
3       1  35.0      1      0  53.1000       1     0
4       3  35.0      0      0   8.0500       0     1

In [55]:
columns = ["Pclass", "Age", "SibSp","Parch","Fare","female","male"]

In [47]:
X_train, X_test, y_train, y_test = train_test_split(inputs,targets,test_size=0.2)

In [48]:
X_train.shape

(712, 7)

In [49]:
X_test.shape

(179, 7)

In [50]:
my_tree_one = tree.DecisionTreeClassifier(criterion="entropy", max_depth=3)

In [51]:
my_tree_one = my_tree_one.fit(X_train,y_train)

In [52]:
my_tree_one

DecisionTreeClassifier(criterion='entropy', max_depth=3)

In [53]:
print(my_tree_one.feature_importances_)

[0.28018668 0.10963832 0.         0.         0.04587468 0.
 0.56430032]

In [54]:
print(my_tree_one.score(X_train,y_train))

0.8188202247191011

In [56]:
list(zip(columns,my_tree_one.feature_importances_))

[('Pclass', 0.28018668108700584),
 ('Age', 0.10963831501051244),
 ('SibSp', 0.0),
 ('Parch', 0.0),
 ('Fare', 0.045874683256587535),
 ('female', 0.0),
 ('male', 0.5643003206458942)]